app/ThirdParty/Auth/Controllers/LoginController.php

	public function attemptLogin()
	{
		// validate request
		$rules = [
			'id'		    => 'required|min_length[2]',
			'password' 	=> 'required|min_length[5]',
		];

		if (! $this->validate($rules)) {
			return redirect()->to('login')
				->withInput()
				->with('errors', $this->validator->getErrors());
		}

		// check credentials
		$users = new UserModel();
		$user = $users
              ->where('id', $this->request->getPost('id'))
              ->first();
---
SELECT *
FROM `users`
WHERE `id` = 'beautynetkr'
 LIMIT 1

                          ->join('currency_rate AS CR', '(CR.currency_idx = currency.idx AND CR.default_set = 1 AND CR.available = 1)')
                          ->where(["currency_rate.cRate_idx"=> $buyerCurrency['cRate_idx']])->first();
          } else {
            $currency = $currencies->currencyJoin()
                          ->select("{$currencies->table}.*")
                          ->select("currency_rate.cRate_idx, currency_rate.exchange_rate, currency_rate.default_set")
                          ->where(["{$currencies->table}.default_currency" => 1, "{$currencies->table}.available" => 1, 'currency_rate.default_set' => 1])
                          ->first();
---
SELECT `currency`.*, `currency_rate`.`cRate_idx`, `currency_rate`.`exchange_rate`, `currency_rate`.`default_set`
FROM `currency`
JOIN `currency_rate` ON `currency_rate`.`currency_idx` = `currency`.`idx`
WHERE `currency`.`available` = 1
AND `currency_rate`.`available` = 1
AND `currency`.`default_currency` = 1
AND `currency`.`available` = 1
AND `currency_rate`.`default_set` = 1
 LIMIT 1