app/ThirdParty/Auth/Models/UserModel.php

SELECT `idx`
FROM `users`
WHERE `id` = 'beautynetkr'
 LIMIT 1
---
  public function getUserIndex($data)
  {
    if ( !isset($data) ) return null;

    $userIdx = $this->select('idx')->where('id', $data)->first();