app/Controllers/CartController.php

SELECT *
FROM `cart`
WHERE `updated_at` < '2023-07-20 23:59:59'
UPDATE `cart` SET `apply_discount` = 0, `updated_at` = '2023-07-27 16:35:22'
WHERE `buyer_id` = '1'
---
  public function initialCartList() {
    $cartList = $this->cart->where(['updated_at <' => $this->checkDate])->findAll();
    if ( !empty($cartList) ) {
      $this->removeCart(['updated_at <' => $this->checkDate]);
      unset($cartList);
    }

    // $cartList = $this->cart
    //               ->cartJoin()
    //               ->where(['cart.buyer_id' => session()->userData['buyerId']])
    //               ->findAll();
    // if ( !empty($cartList) ) {
    //   print_r($cartList);
    // }

    if ( !empty($this->getCartTotalPrice()) ) {
      if ( $this->getCartTotalPrice()['order_price_total'] < $this->basedDiscountVal ) {
        $this->cart
            ->set(['apply_discount' => 0])
            ->where(['buyer_id' => session()->userData['buyerId']])
            ->update();
      } else {
        $this->cart
            ->set(['apply_discount' => 1])
            ->where(['buyer_id' => session()->userData['buyerId']])
            ->update();