app/Controllers/Home.php

  public function main() {
    $this->data['notices'] = $this->notice->board(['board_type.available' => 1
                                                , 'board.type_idx' => 1])
                                          ->orderBy('board.fixed DESC, board.sort ASC, board.idx ASC')
                                          ->findAll(8);
    $this->data['qna'] = $this->notice->board(['board_type.available' => 1
                                              , 'board.type_idx' => 2])
                                      ->orderBy('board.fixed DESC, board.sort ASC, board.idx ASC')
                                      ->findAll(8);
---
SELECT `board`.*, `board_type`.`name_kr` AS `type_name_kr`, `board_type`.`name_en` AS `type_name_en`, `board_type`.`available` AS `type_available`
FROM `board`
JOIN `board_type` ON `board`.`type_idx` = `board_type`.`idx`
WHERE `board_type`.`available` = 1
AND `board`.`type_idx` = 1
ORDER BY `board`.`fixed` DESC, `board`.`sort` ASC, `board`.`idx` ASC
 LIMIT 8
SELECT `board`.*, `board_type`.`name_kr` AS `type_name_kr`, `board_type`.`name_en` AS `type_name_en`, `board_type`.`available` AS `type_available`
FROM `board`
JOIN `board_type` ON `board`.`type_idx` = `board_type`.`idx`
WHERE `board_type`.`available` = 1
AND `board`.`type_idx` = 2
ORDER BY `board`.`fixed` DESC, `board`.`sort` ASC, `board`.`idx` ASC
 LIMIT 8