app/Controllers/Inventory.php

SELECT *
FROM `countries`
SELECT *
FROM `requirement`
WHERE `display` = 1
---
  public function requestInventoryCheck() {
    $country = new CountryModel();
    $requirement = new RequirementModel();

    if ( $this->CartController->checkMinimumAmount() === false ) {
      if ( $this->request->isAJAX()) {
        return json_encode(['error' => lang('Order.orderMinCheck', [$this->CartController->basedMinimumOrderVal])]);
      }
      return redirect()->to(site_url('/order'))->with('error', lang('Order.orderMinCheck', [$this->CartController->basedMinimumOrderVal]));
    }

    $this->data['prevAddrList'] = $this->address->where('buyer_id', session()->userData['buyerId'])->orderBy('idx DESC')->findAll(0, 1);
    $this->data['regions'] = $country->findAll();
    $this->data['itus'] = $this->OrderController->getItus()->findAll();
    $this->data['requirements'] = $requirement->where('display', 1)->findAll();

SELECT *
FROM `cart`
WHERE `buyer_id` = '1'
---
  public function requestInventory() {
    $data = $this->request->getVar();
    // print_r($data['requirement']);
    $request = [];

    $cartList = $this->cart->where('buyer_id', session()->userData['buyerId'])->findAll();

INSERT INTO `orders` (`buyer_id`, `order_number`, `request_amount`, `currency_rate_idx`, `currency_code`, `address_id`, `created_at`, `updated_at`) VALUES ('1', '202308070004', '1111.8', '2', 'USD', '1', '2023-08-07 17:21:11', '2023-08-07 17:21:11')
---
        // }

        // if ( $this->cart->affectedRows() ) {
          if ( $this->order->save($request) ) {

INSERT INTO `delivery` (`order_id`, `created_at`, `updated_at`) VALUES (7, '2023-08-07 17:21:11', '2023-08-07 17:21:11')
INSERT INTO `packaging` (`order_id`, `created_at`, `updated_at`) VALUES (7, '2023-08-07 17:21:11', '2023-08-07 17:21:11')
SELECT *
FROM `packaging_detail`
WHERE `packaging_id` = 5
AND `status_id` = 1
INSERT INTO `packaging_detail` (`packaging_id`, `status_id`, `in_progress`, `created_at`, `updated_at`) VALUES (5, 1, 1, '2023-08-07 17:21:11', '2023-08-07 17:21:11')
---
            $orderDetailFailed = $this->setOrderDetail($orderId);

            if ( empty($orderDetailFailed) ) {  // detail 입력중 오류 없음
              if ( $this->delivery->save(['order_id' => $orderId]) ) {
                if ( $this->packaging->save(['order_id' => $orderId]) ) {
                  if ( empty($this->packagingDetail->where(['packaging_id'=> $this->packaging->getInsertID(), 'status_id' => 1])->find() ) ) {
                    if ( $this->packagingDetail->save(['packaging_id' => $this->packaging->getInsertID()
                                                  , 'status_id' => 1
                                                  , 'in_progress' => 1]) ) :

UPDATE `orders` SET `available` = 1, `updated_at` = '2023-08-07 17:21:11'
WHERE `orders`.`id` IN (7)
---
              // else $orderStatusId = 1;

              // if ( !empty($orderStatus) && !empty($orderStatusId) ) {
                if ( $this->order->save(['id'=> $orderId, 'available'=> 1]) ) {

SELECT *
FROM `buyers`
WHERE `id` = '1'
AND `available` = 1
 LIMIT 1
SELECT `cart`.`buyer_id`, `cart`.`prd_id`, `cart`.`brand_id`, `cart`.`product_price_idx` AS `prd_price_id`, `cart`.`order_qty` AS `prd_order_qty`, `cart`.`margin_section_id`, `supply_price`.`price` AS `prd_price`
FROM `cart`
JOIN `supply_price` ON `supply_price`.`product_price_idx` = `cart`.`product_price_idx`
WHERE `cart`.`buyer_id` = '1'
AND `supply_price`.`margin_level` = '2'
---
  public function setOrderDetail($orderId) {
    $margin_level = 2;
    $data = $this->request->getVar();
    $failed = [];

    if ( empty($orderId) ) return session()->setFlashdata('error', '재고요청서 작성 중 오류가 발생됐습니다.');

    $buyer = $this->buyer->where(['id'=> session()->userData['buyerId'], 'available'=> 1])->first();
    if ( !empty($buyer) ) $margin_level = $buyer['margin_level'];
    else return session()->setFlashdata('error', 'buyer 정보가 일치하지 않음');

    $cartList = $this->cart
                  ->select('cart.buyer_id,
                          cart.prd_id,
                          cart.brand_id,
                          cart.product_price_idx AS prd_price_id,
                          cart.order_qty AS prd_order_qty,
                          cart.margin_section_id,
                          supply_price.price AS prd_price')
                  ->join('supply_price', 'supply_price.product_price_idx = cart.product_price_idx')
                  ->where(['cart.buyer_id'=> session()->userData['buyerId']
                          , 'supply_price.margin_level' => $margin_level])->findAll();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE DATE(`created_at`) = '2023-08-07'
---
  public function makeOrderNumber() {
    // $cnt = $this->order->where(['DATE(`created_at`)' => 'DATE(NOW())', 'available' => 1])->countAllResults();
    $cnt = $this->order->where(['DATE(`created_at`)' => date('Y-m-d', time())])->countAllResults();