app/Controllers/Inventory.php

  public function requestInventory() {
    $data = $this->request->getVar();
    // print_r($data['requirement']);
    $request = [];

    $cartList = $this->cart->where('buyer_id', session()->userData['buyerId'])->findAll();
    if ( !empty($cartList) ) {
      if ( !empty($data['address']['address_operate']) ) {
        $addressId = $this->AddressController->addressConduct();
      } else {
        $addressId = $data['address']['idx'];
      }

      if ( !empty($addressId) ) {
        $requestPrice = $this->CartController->getCartTotalPrice();
        if ( !empty($requestPrice) ) {
          $request['buyer_id'] = session()->userData['buyerId'];
          $request['order_number'] = date('Ymd', time()).sprintf('%04d', ($this->makeOrderNumber() + 1));
          $request['request_amount'] = $requestPrice['order_price_total'];
          $request['inventory_fixed_amount'] = $requestPrice['order_price_total'];
          $request['currency_rate_idx'] = session()->currency['currencyId'];
          $request['currency_code'] = session()->currency['currencyUnit'];
          $request['address_id']  = $addressId;

          var_dump($request);

          if ( $this->order->save($request) ) {
---
INSERT INTO `orders` (`buyer_id`, `order_number`, `address_id`, `created_at`, `updated_at`) VALUES ('1', '202307270001', '1', '2023-07-27 16:35:40', '2023-07-27 16:35:40')

            $orderDetailFailed = $this->setOrderDetail($orderId);
            var_dump($orderDetailFailed);
            if ( empty($orderDetailFailed) ) {  // detail 입력중 오류 없음
              if ( $this->delivery->save(['order_id' => $orderId]) ) {
                if ( $this->packaging->save(['order_id' => $orderId]) ) {
                  if ( empty($this->packagingDetail->where(['packaging_id'=> $this->packaging->getInsertID(), 'status_id' => 1])->find() ) ) {
                    if ( $this->packagingDetail->save(['packaging_id' => $this->packaging->getInsertID()
                                                  , 'status_id' => 1
                                                  , 'in_progress' => 1]) ) :
---
INSERT INTO `delivery` (`order_id`, `created_at`, `updated_at`) VALUES (1, '2023-07-27 16:35:40', '2023-07-27 16:35:40')
INSERT INTO `packaging` (`order_id`, `created_at`, `updated_at`) VALUES (1, '2023-07-27 16:35:40', '2023-07-27 16:35:40')
SELECT *
FROM `packaging_detail`
WHERE `packaging_id` = 1
AND `status_id` = 1
INSERT INTO `packaging_detail` (`packaging_id`, `status_id`, `in_progress`, `created_at`, `updated_at`) VALUES (1, 1, 1, '2023-07-27 16:35:40', '2023-07-27 16:35:40')