app/Controllers/Orders.php

  public function index() {
    $this->data['orders'] = $this->getOrderList();

    // if ( empty($this->request->getGet('order_number')) || empty($this->data['order']['order_number'])) {
    if ( empty($this->request->getGet('order_number')) ) {
      $this->data['statistics'] = $this->ordersStatistics();
      $this->data['orderBrand'] = $this->order->select('brand.brand_name, COUNT(brand.brand_id) AS cnt')
                                    ->join('orders_detail', 'orders_detail.order_id = orders.id')
                                    ->join('product', 'product.id = orders_detail.prd_id')
                                    ->join('brand', 'brand.brand_id = product.brand_id')
                                    ->where('orders.buyer_id', session()->userData['buyerId'])
                                    ->where('orders.available', 1)
                                    ->groupby('brand.brand_id')
                                    ->findAll(10);
    } else {
      $this->data['order'] = $this->getOrder();
      $this->data['paymentMethod'] = $this->getPaymentMethod();
      // $this->data['receipts'] = $this->getOrderReceipts();
      $this->data['orderDetails'] = $this->getOrderDetails();
      // $this->data['shippinCost'] = $this->getTotalShippingCost();
      // $this->data['buyer'] = $this->getBuyer();
      // $this->data['packaging'] = $this->packaging->where('order_id', $this->orderId)->first();
      $this->data['packagingStatus'] = $this->packagingStatus
                                            ->select('packaging_status.*')
                                            ->select('packaging.complete')
                                            ->select('packaging.in_progress')
                                            ->join("( SELECT packaging.idx, packaging.order_id
                                                            , packaging_detail.packaging_id, packaging_detail.status_id
                                                            , packaging_detail.in_progress, packaging_detail.complete
                                                      FROM packaging
                                                      LEFT OUTER JOIN packaging_detail ON packaging.idx = packaging_detail.packaging_id
                                                      WHERE packaging.order_id = {$this->orderId}) AS packaging"
                                                    , "packaging.status_id = packaging_status.idx", "left outer")
                                            ->where(['packaging_status.available' => 1
                                                  , 'packaging_status.display' => 1])
                                            ->orderBy('packaging_status.order_by')
                                            ->findAll();
---
SELECT `brand`.`brand_name`, COUNT(brand.brand_id) AS cnt
FROM `orders`
JOIN `orders_detail` ON `orders_detail`.`order_id` = `orders`.`id`
JOIN `product` ON `product`.`id` = `orders_detail`.`prd_id`
JOIN `brand` ON `brand`.`brand_id` = `product`.`brand_id`
WHERE `orders`.`buyer_id` = '1'
AND `orders`.`available` = 1
GROUP BY `brand`.`brand_id`
 LIMIT 10
SELECT `packaging_status`.*, `packaging`.`complete`, `packaging`.`in_progress`
FROM `packaging_status`
LEFT OUTER JOIN ( SELECT packaging.idx, packaging.order_id
                                                            , packaging_detail.packaging_id, packaging_detail.status_id
                                                            , packaging_detail.in_progress, packaging_detail.complete
                                                      FROM packaging
                                                      LEFT OUTER JOIN packaging_detail ON packaging.idx = packaging_detail.packaging_id
                                                      WHERE packaging.order_id = 7) AS packaging ON `packaging`.`status_id` = `packaging_status`.`idx`
WHERE `packaging_status`.`available` = 1
AND `packaging_status`.`display` = 1
ORDER BY `packaging_status`.`order_by`

  public function getOrderList() {
    $page = null;

    if ( !empty($this->request->getPost('order_number')) ) {
      $this->order->like('order_number', $this->request->getVar('order_number'), 'both');
    }

    $orders = $this->order
                ->where(['buyer_id'=> session()->userData['buyerId']
                        , 'available' => 1])
                ->orderBy('created_at DESC')
                ->paginate(15, 'default', $page);

    // $this->data['ordersListPage'] = 'ordersListPage';
    $this->data['ordersPager'] = $this->order->pager;
---
SELECT *
FROM `orders`
WHERE `buyer_id` = '1'
AND `available` = 1
ORDER BY `created_at` DESC
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `buyer_id` = '1'
AND `available` = 1
SELECT *
FROM `orders`
WHERE `buyer_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `buyer_id` = '1'

  public function getOrder() {
    $order = $this->order
                ->select('orders.*')
                ->select('currency.currency_sign, currency.currency_float')
                ->join('currency', 'currency.currency_code = orders.currency_code')
                ->where(['order_number' => $this->request->getVar('order_number')
                        ,'buyer_id' => session()->userData['buyerId']])
                ->first();
---
SELECT `orders`.*, `currency`.`currency_sign`, `currency`.`currency_float`
FROM `orders`
JOIN `currency` ON `currency`.`currency_code` = `orders`.`currency_code`
WHERE `order_number` = '202308070004'
AND `buyer_id` = '1'
 LIMIT 1