app/Controllers/Order.php

SELECT *
FROM `brand`
WHERE `available` = '1'
---
  public function brandList() {
    $page = null;
    $brandGroup = 'brand';

    $brands = $this->brands->where('available', '1')->findAll();

SELECT *
FROM `product_price`
WHERE `product_idx` = '2'
AND `available` = 1
 LIMIT 1
---
  public function addCartList() {
    $code = 500;
    $msg = '';
    $data = $this->request->getPost();

    if ( !empty(session()->userData['buyerId']) ) {
      $data['prd_section'] = (!empty($this->getBuyerInfo()) ? $this->getBuyerInfo()['margin_level'] : 2);
      $data['buyer_id'] = session()->userData['buyerId'];

      if ( empty($data['brand_id']) && !empty($data['brd_id']) ) {
        $data['brand_id'] = $data['brd_id'];
        unset($data['brd_id']);
      }

      // $cartWhere = ['buyer_id' => session()->userData['buyerId']];
      $cartWhere = ['buyer_id' => $data['buyer_id']];
      if ( !empty($data['prd_id']) ) {
        $cartWhere = array_merge($cartWhere, ['prd_id' => $data['prd_id']]);
      }
      if ( !empty($data['stock_req']) && isset($data['stock_req']) ) {
        $cartWhere = array_merge($cartWhere, ['stock_req' => $data['stock_req']]);
      }
      if ( !empty($data['cart_idx']) && isset($data['cart_idx']) ) {
        $cartWhere = array_merge($cartWhere, ['idx' => $data['cart_idx']]);
        $data['stock_req_parent'] = $data['cart_idx'];
      }
      if ( !empty($data['prd_id']) ) {
        $productPrice = $this->productPrice
                            ->where(['product_idx' => $data['prd_id']
                                  , 'available' => 1])
                            ->first();

SELECT *
FROM `cart`
WHERE `buyer_id` = '1'
AND `prd_section` != 'dis_section'
AND `apply_discount` = 1
---
  public function applyDiscountCart(Int $totalPrice = null) {
    if ( $totalPrice == NULL ) $invoiceTotal = $this->CartController->getCartTotalPrice();
    else $invoiceTotal['order_price_total'] = $totalPrice;

    if ( !empty($invoiceTotal['order_price_total']) ) {
      $this->cart->where('buyer_id', session()->userData['buyerId']);
      if ( $invoiceTotal['order_price_total'] >= $this->CartController->basedDiscountVal ) {
        $carts = $this->cart
                      // ->where('user_id', $userId)
                      ->where('apply_discount', 0)
                      ->where('prd_section !=', 1)
                      ->findAll();
        if ( !empty($carts) ) {
          $this->cart->where(['buyer_id'=> session()->userData['buyerId'],
                                'apply_discount'=> 0,
                                'prd_section !=' => 1])
                        ->set(['apply_discount'=> 1])->update();

          // if ( $this->cart->affectedRows() ) {
          //   $session()->set('applyDiscount', true);
          // }
        }
      } else {
        // $carts = $this->cart->where(['user_id' => $userId, 'prd_section !=' => 'dis_section', 'apply_discount' => 1])->findAll();
        $carts = $this->cart->where(['prd_section !=' => 'dis_section', 'apply_discount' => 1])->findAll();

SELECT *
FROM `buyers`
WHERE `id` = '1'
 LIMIT 1
---
  public function getBuyerInfo() {
    $buyer = $this->buyers->where('id', session()->userData['buyerId'])->first();